{
  "fp_vocab_size": 174,
  "num_attention_heads": 12,
  "_attn_implementation": "eager",
  "attention_probs_dropout_prob": 0,
  "hidden_dropout_prob": 0,
  "graph_hidden_size": 128,
  "layer_norm_eps": 1e-08,
  "bos_token_id": 2362,
  "eos_token_id": 2363,
  "pad_token_id": 2,
  "conv_kernel": 4,
  "d_inner": 160,
  "d_model": 768,
  "dt_rank": "auto",
  "expand": 2,
  "fused_add_norm": true,
  "hidden_act": "silu",
  "hidden_size": 768,
  "initializer_range": 0.1,
  "intermediate_size": 3072,
  "layer_norm_epsilon": 1e-08,
  "model_type": "mamba",
  "n_layer": 16,
  "num_hidden_layers": 16,
  "pad_vocab_size_multiple": 8,
  "rescale_prenorm_residual": false,
  "residual_in_fp32": true,
  "rms_norm": true,
  "ssm_cfg": {},
  "state_size": 16,
  "time_step_floor": 0.0001,
  "time_step_init_scheme": "random",
  "time_step_max": 0.1,
  "time_step_min": 0.001,
  "time_step_rank": 64,
  "time_step_scale": 1.0,
  "torch_dtype": "float32",
  "transformers_version": "4.39.0.dev0",
  "use_bias": false,
  "use_cache": true,
  "use_conv_bias": true,
  "vocab_size": 2364,
  "brics": false,
  "geo_operation": false,
  "use_graph_embeddings": false,
  "no_self_attention": false
}
